#+TITLE: macs
#+FILETAGS: core
* Overview
Macros for the macro-programmer.

This is a core library module.

Some of the symbols provided are copied directly from their original
source and annotated appropriately. It is not guaranteed that all
symbols perform exactly as the originals. Read the inline comments if
you're unsure.

- requires :: =sbcl 2.3.7+=

#+begin_src lisp :results replace :exports both
  ;; hg clone https://lab.rwest.io/ellis/macs && cd macs && sbcl
  (asdf:load-asd "macs.asd")
  (ql:quickload :macs)
  (ql:quickload :macs/rt)
  (in-package :macs-user)
  (use-package :macs.rt)
  (mapcar ;; list all symbols
   (lambda (p) (cons p (loop for s being the external-symbols of (find-package p) collect s)))
   '(:macs.readtables :macs.reexport :macs.str :macs.sym :macs.list :macs.cond :macs.fu
     :macs.ana :macs.pan :macs.cli :macs.fs :macs.alien :macs.rt))
#+end_src
#+RESULTS:
#+begin_example
((:MACS.READTABLES READTABLE-ERROR UNREGISTER-READTABLE READER-MACRO-CONFLICT
  ENSURE-READTABLE COPY-NAMED-READTABLE PARSE-BODY DEFREADTABLE
  REGISTER-READTABLE LIST-ALL-NAMED-READTABLES IN-READTABLE RENAME-READTABLE
  NAMED-READTABLE-DESIGNATOR FIND-READTABLE READTABLE-DOES-ALREADY-EXIST
  READTABLE-DOES-NOT-EXIST MAKE-READTABLE READTABLE-NAME MERGE-READTABLES-INTO)
 (:MACS.REEXPORT REEXPORT-FROM REEXPORTS)
 (:MACS.STR UNICODE> UNICODE< STRING-DESIGNATOR GRAPHEMES LINES BIDI-CLASS
  DEFAULT-IGNORABLE-P ALPHABETIC-P DECIMAL-VALUE CHAR-BLOCK LOWERCASE STRIPLN
  SENTENCE-BREAK-CLASS UNICODE-EQUAL STRING-SUFFIX-P SPLIT-STRING DIGIT-VALUE
  CASEFOLD STRING-ENCLOSED-P LINE-BREAK-CLASS NORMALIZED-P UPPERCASE-P
  GRAPHEME-BREAK-CLASS SENTENCES UPPERCASE UNICODE= HEX-DIGIT-P CASED-P
  UNICODE<= MATH-P UNICODE>= TITLECASE WORDS BIDI-MIRRORING-GLYPH
  NORMALIZE-STRING LOWERCASE-P MIRRORED-P CONFUSABLE-P WORD-BREAK-CLASS STRCAT
  WHITESPACE-P)
 (:MACS.SYM MAKE-SLOT-NAME ENSURE-SYMBOL KEYWORDICATE SYMBOLICATE
  PACKAGE-SYMBOLICATE FORMAT-SYMBOL GENSYMIFY* MAKE-KEYWORD MAKE-GENSYM
  WITH-UNIQUE-NAMES WITH-GENSYMS MAKE-GENSYM-LIST)
 (:MACS.LIST PROPER-LIST-P ENSURE-LIST ASSQ MEMQ ENSURE-CAR RECONS
  PROPER-LIST-OF-LENGTH-P SINGLETON-P ENSURE-CONS)
 (:MACS.COND SIMPLE-PROGRAM-ERROR SIMPLE-READER-ERROR INVALID-ARGUMENT-ITEM
  UNKNOWN-ARGUMENT-P INVALID-ARGUMENT SIMPLE-STYLE-WARNING
  UNKNOWN-ARGUMENT-NAME IGNORE-SOME-CONDITIONS MISSING-ARGUMENT-P
  INVALID-ARGUMENT-REASON INVALID-ARGUMENT-P MISSING-ARGUMENT UNKNOWN-ARGUMENT
  UNWIND-PROTECT-CASE CIRCULAR-DEPENDENCY-ITEMS NYI! CIRCULAR-DEPENDENCY
  SIMPLE-PARSE-ERROR REQUIRED-ARGUMENT MISSING-ARGUMENT-COMMAND
  UNKNOWN-ARGUMENT-KIND)
 (:MACS.FU METHOD-COMBINATION-LAMBDA-LIST O!-SYMBOL-P PARSE-LAMBDA-LIST
  WHO-SPECIALIZES-DIRECTLY FIND-FUNCTION-CALLERS TLIST-EMPTY-P TLIST-ADD-RIGHT
  SOURCE-LOCATION DLAMBDA |#"-reader| FIND-FUNCTION-CALLEES DESTRUCTURING-ECASE
  PARSE-EVAL-WHEN-SITUATIONS FLATTEN |#`-reader| DEFCMD O!-SYMBOL-TO-G!-SYMBOL
  ,*MACS-READTABLE* CHOOSE WHEN-MATCH DEFUN! TLIST-ADD-LEFT IF-LET* IF-MATCH
  MKSTR SYMB FUNCTION-TYPE MAKE-MACRO-LAMBDA WHO-SPECIALIZES-GENERALLY GROUP
  DEFTYPE-LAMBDA-LIST DEFMACRO/G! SUBST-MODE-PPCRE-LAMBDA-FORM SEGMENT-READER
  WHEN-LET* TLIST-REM-LEFT MATCH-MODE-PPCRE-LAMBDA-FORM ALLOCATION-INFORMATION
  DEFMACRO! FACT SORTF DOLLAR-SYMBOL-P DESTRUCTURING-CCASE G!-SYMBOL-P
  FUNCTION-LAMBDA-LIST WHEN-LET BUILD-BATCHER-SN MAKE-TLIST TLIST-UPDATE
  DESTRUCTURING-CASE |#f-reader| IF-LET TLIST-LEFT TLIST-RIGHT ONCE-ONLY)
 (:MACS.ANA ALAMBDA ALET AIF ALET% SELF IT THIS NLET-TAIL AWHEN ACOND)
 (:MACS.PAN PANDORICLET-GET PANDORIC-RECODE WITH-PANDORIC PLAMBDA PANDORICLET
  PANDORIC-EVAL PANDORICLET-SET PANDORIC-HOTPATCH GET-PANDORIC)
 (:MACS.CLI INIT-ARGS ARG-P CLI-USAGE CLI-OPTS CLI-HELP MAKE-CLI
  HANDLE-MISSING-ARGUMENT MAIN CLI-CMDS WITH-CLI *ARGV* MAKE-SHORTY
  HANDLE-UNKNOWN-ARGUMENT CLI-CMD CLI-ARGS HANDLE-INVALID-ARGUMENT
  WITH-CLI-HANDLERS PRINT-HELP *CLI-GROUP-SEPARATOR* CLI-OPT CLI CLI-VERSION
  MAKE-CMDS DEFMAIN CLI-NAME RUN-CMD COMMAND-LINE-ARGS EXEC-PATH-LIST CLI-ARG0
  MAKE-OPTS PARSE-ARGS PRINT-USAGE PRINT-VERSION)
 (:MACS.FS)
 (:MACS.ALIEN F24 BOOL-TO-FOREIGN-INT I4 U128 U2 U4 U64 U32
  SANCTIFY-FOR-EXECUTION U3 U24 I64 I32 DEFBYTES I128 I2 F64 F32
  FOREIGN-INT-TO-INTEGER I8 FOREIGN-INT-TO-BOOL I3 I16 U8 I24 U1 F16 U16 F128)
 (:MACS.RT TEST-DEBUG-TIMESTAMP-SOURCE SUITE-NAME-EQ IN-SUITE WITH-TEST-ENV
  TEST-OBJECT IS TESTS SUITE-NAME= TEST-FIXTURE *DEFAULT-TEST-SUITE-NAME*
  MAKE-TEST *TESTING* FIND-TEST TEST-SUITE *TEST-SUITE* MAKE-SUITE TEST-FAILS
  DO-SUITE DEFTEST PUSH-TEST DEFSUITE TEST-RESULTS SIGNALS *TEST-SUFFIX* TEST
  POP-TEST DO-TESTS TEST-FAILED *COMPILE-TESTS* FAIL! EVAL-TEST
  CHECK-SUITE-DESIGNATOR ENSURE-SUITE LOCKED-TESTS CONTINUE-TESTING
  GET-TEST-OPT WITH-TEST *TEST-SUITE-LIST* TEST-SUITE-DESIGNATOR DO-TEST
  ,*TEST-DEBUG-TIMESTAMP* TEST-NAME *TEST-DEBUG* DELETE-TEST *CATCH-TEST-ERRORS*
  COMPILE-TEST))
#+end_example
